In [1]:
import pandas as pd

In [4]:
data = pd.DataFrame({
    'Name':['Nitin','Pranav'],
    ' Top Subjects':['Special Electrical Machines','Soft Computing'],
    'Marks':[69,74]
})
print(data)

     Name                 Top Subjects  Marks
0   Nitin  Special Electrical Machines     69
1  Pranav               Soft Computing     74

In [5]:
data1=pd.DataFrame({
    'Name':['Rohan Sanjay','Tamil Pandian','Suren'],
    'Top Subjects':['Analog system design','Electrical drives','Basic mechanical Engineeerng'],
    'Marks':[64,65,63]
})
print(data1)

            Name                  Top Subjects  Marks
0   Rohan Sanjay          Analog system design     64
1  Tamil Pandian             Electrical drives     65
2          Suren  Basic mechanical Engineeerng     63

In [15]:
a=data.merge(data1,how='outer')
print(a)

            Name                 Top Subjects  Marks  \
0          Nitin  Special Electrical Machines     69
1         Pranav               Soft Computing     74
2   Rohan Sanjay                          NaN     64
3  Tamil Pandian                          NaN     65
4          Suren                          NaN     63

                   Top Subjects
0                           NaN
1                           NaN
2          Analog system design
3             Electrical drives
4  Basic mechanical Engineeerng

In [16]:
data2=pd.DataFrame({
    'blood group':['o+','o+','o+','A+','o+']
})
print(a.join(data2))

            Name                 Top Subjects  Marks  \
0          Nitin  Special Electrical Machines     69
1         Pranav               Soft Computing     74
2   Rohan Sanjay                          NaN     64
3  Tamil Pandian                          NaN     65
4          Suren                          NaN     63

                   Top Subjects blood group
0                           NaN          o+
1                           NaN          o+
2          Analog system design          o+
3             Electrical drives          A+
4  Basic mechanical Engineeerng          o+

In [20]:
print(a.merge(data2,how='cross'))

             Name                 Top Subjects  Marks  \
0           Nitin  Special Electrical Machines     69
1           Nitin  Special Electrical Machines     69
2           Nitin  Special Electrical Machines     69
3           Nitin  Special Electrical Machines     69
4           Nitin  Special Electrical Machines     69
5          Pranav               Soft Computing     74
6          Pranav               Soft Computing     74
7          Pranav               Soft Computing     74
8          Pranav               Soft Computing     74
9          Pranav               Soft Computing     74
10   Rohan Sanjay                          NaN     64
11   Rohan Sanjay                          NaN     64
12   Rohan Sanjay                          NaN     64
13   Rohan Sanjay                          NaN     64
14   Rohan Sanjay                          NaN     64
15  Tamil Pandian                          NaN     65
16  Tamil Pandian                          NaN     65
17  Tamil Pandian                          NaN     65
18  Tamil Pandian                          NaN     65
19  Tamil Pandian                          NaN     65
20          Suren                          NaN     63
21          Suren                          NaN     63
22          Suren                          NaN     63
23          Suren                          NaN     63
24          Suren                          NaN     63

                    Top Subjects blood group
0                            NaN          o+
1                            NaN          o+
2                            NaN          o+
3                            NaN          A+
4                            NaN          o+
5                            NaN          o+
6                            NaN          o+
7                            NaN          o+
8                            NaN          A+
9                            NaN          o+
10          Analog system design          o+
11          Analog system design          o+
12          Analog system design          o+
13          Analog system design          A+
14          Analog system design          o+
15             Electrical drives          o+
16             Electrical drives          o+
17             Electrical drives          o+
18             Electrical drives          A+
19             Electrical drives          o+
20  Basic mechanical Engineeerng          o+
21  Basic mechanical Engineeerng          o+
22  Basic mechanical Engineeerng          o+
23  Basic mechanical Engineeerng          A+
24  Basic mechanical Engineeerng          o+

In [24]:
z=pd.read_csv(r'C:\Users\TCS\Downloads\emp.csv')
z.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services

In [26]:
a=z.fillna(method='pad')
print(a)

    First Name  Gender  Start Date Last Login Time  Salary  Bonus %  \
0      Douglas    Male    8/6/1993        12:42 PM   97308    6.945
1       Thomas    Male   3/31/1996         6:53 AM   61933    4.170
2        Maria  Female   4/23/1993        11:17 AM  130590   11.858
3        Jerry    Male    3/4/2005         1:00 PM  138705    9.340
4        Larry    Male   1/24/1998         4:47 PM  101004    1.389
..         ...     ...         ...             ...     ...      ...
995      Henry    Male  11/23/2014         6:09 AM  132483   16.655
996    Phillip    Male   1/31/1984         6:30 AM   42392   19.675
997    Russell    Male   5/20/2013        12:39 PM   96914    1.421
998      Larry    Male   4/20/2013         4:45 PM   60500   11.985
999     Albert    Male   5/15/2012         6:24 PM  129949   10.169

     Senior Management                  Team
0                 True             Marketing
1                 True             Marketing
2                False               Finance
3                 True               Finance
4                 True       Client Services
..                 ...                   ...
995              False          Distribution
996              False               Finance
997              False               Product
998              False  Business Development
999               True                 Sales

[1000 rows x 8 columns]

In [29]:
z=z[z['Bonus %']>10]
print(z)

    First Name  Gender  Start Date Last Login Time  Salary  Bonus %  \
2        Maria  Female   4/23/1993        11:17 AM  130590   11.858
5       Dennis    Male   4/18/1987         1:35 AM  115163   10.125
6         Ruby  Female   8/17/1987         4:20 PM   65476   10.012
7          NaN  Female   7/20/2015        10:43 AM   45906   11.598
8       Angela  Female  11/22/2005         6:29 AM   95570   18.523
..         ...     ...         ...             ...     ...      ...
993       Tina  Female   5/15/1997         3:53 PM   56450   19.040
995      Henry     NaN  11/23/2014         6:09 AM  132483   16.655
996    Phillip    Male   1/31/1984         6:30 AM   42392   19.675
998      Larry    Male   4/20/2013         4:45 PM   60500   11.985
999     Albert    Male   5/15/2012         6:24 PM  129949   10.169

    Senior Management                  Team
2               False               Finance
5               False                 Legal
6                True               Product
7                 NaN               Finance
8                True           Engineering
..                ...                   ...
993              True           Engineering
995             False          Distribution
996             False               Finance
998             False  Business Development
999              True                 Sales

[495 rows x 8 columns]

In [30]:
y=z.drop(['Last Login Time'],axis=1)
print(y)

    First Name  Gender  Start Date  Salary  Bonus % Senior Management  \
2        Maria  Female   4/23/1993  130590   11.858             False
5       Dennis    Male   4/18/1987  115163   10.125             False
6         Ruby  Female   8/17/1987   65476   10.012              True
7          NaN  Female   7/20/2015   45906   11.598               NaN
8       Angela  Female  11/22/2005   95570   18.523              True
..         ...     ...         ...     ...      ...               ...
993       Tina  Female   5/15/1997   56450   19.040              True
995      Henry     NaN  11/23/2014  132483   16.655             False
996    Phillip    Male   1/31/1984   42392   19.675             False
998      Larry    Male   4/20/2013   60500   11.985             False
999     Albert    Male   5/15/2012  129949   10.169              True

                     Team
2                 Finance
5                   Legal
6                 Product
7                 Finance
8             Engineering
..                    ...
993           Engineering
995          Distribution
996               Finance
998  Business Development
999                 Sales

[495 rows x 7 columns]

In [32]:
grouped=z.groupby('Team')
print(grouped.get_group('Engineering'))

    First Name  Gender  Start Date Last Login Time  Salary  Bonus %  \
8       Angela  Female  11/22/2005         6:29 AM   95570   18.523
50       Nancy  Female   9/23/2000         8:05 AM   94976   13.830
59       Irene  Female    5/7/1997         9:32 AM   66851   11.279
122  Christina  Female   4/13/2012         2:04 PM  110169   13.892
171    Patrick    Male   8/17/2007         3:16 AM  143499   17.495
209      Emily  Female   9/20/2007        11:25 AM   89434   11.295
213     Evelyn  Female   5/24/1980        11:10 PM   81673   15.364
228      Bobby    Male   9/23/1994         1:29 AM   51685   17.445
242     Robert    Male  10/27/1990         7:15 PM   38041   18.428
245     Victor    Male   4/11/1991         7:44 AM   70817   17.138
263      Sarah     NaN  11/21/1985         1:08 PM   58295   14.603
301      James    Male   7/11/2015         8:52 PM   72257   13.023
329        NaN    Male   1/27/2010         2:57 AM   87760   14.987
372     Albert    Male    2/1/1997         4:20 PM   67827   19.717
381      Scott    Male    8/3/1996         1:50 AM   64172   10.894
402    Richard     NaN  11/28/1992         5:05 PM  124655   14.272
447    Gregory    Male   5/15/2009         3:52 PM  142208   11.204
474   Jonathan    Male   8/15/2002        12:01 AM  104749   11.364
505        NaN    Male   4/20/1980         1:17 PM   71520   13.248
507   Clarence    Male   11/3/2015        12:11 AM  103684   18.654
521        NaN     NaN   9/25/1981         9:59 AM   83895   17.971
551     Philip    Male   7/18/1985         6:36 AM  122319   19.122
553     Amanda  Female    6/7/2002         7:46 AM  109290   13.853
558      Linda  Female   8/18/1985         4:34 AM   51431   13.295
563      Randy    Male    5/2/2002         7:39 PM   86723   14.842
602      Bobby     NaN   7/21/2003         3:50 PM   84232   15.704
604      Bruce    Male   3/15/2013        11:13 PM  141335   15.427
608        NaN  Female  10/24/1993         5:17 PM  116236   17.274
619    Beverly  Female  10/22/1990         2:45 PM   59070   19.064
680     Albert    Male   6/17/1992         3:25 AM   86818   14.301
705      Harry    Male   9/23/2015         1:36 AM  129148   15.193
711      Karen  Female    1/9/2014        10:09 PM   46478   16.552
712     Martin     NaN    2/6/2001         4:17 AM  123963   15.745
715      Peter    Male   3/22/1982         7:28 AM   77933   13.132
719       John    Male   1/29/1999         3:07 AM   67165   13.001
724     Andrea  Female  12/10/2001         6:40 AM   37888   13.470
761   Jennifer  Female   3/31/2015         7:43 PM  132084   10.006
797       Rose  Female  12/31/1982         6:50 PM  145001   19.850
805     Thomas    Male    5/3/1990         9:29 AM  111371   15.081
935      Alice  Female   3/23/1996         3:09 AM  131952   12.090
941    William    Male   6/26/1997         8:33 AM  104840   15.653
948     Ashley  Female   3/31/2006         1:24 PM  142410   11.048
967     Thomas    Male   3/12/2016         3:10 PM  105681   19.572
969      Linda  Female    2/4/2010         8:49 PM   44486   17.308
983       John    Male  12/23/1982        10:35 PM  146907   11.738
984      Maria  Female  10/15/2011         4:53 PM   43455   13.040
993       Tina  Female   5/15/1997         3:53 PM   56450   19.040

    Senior Management         Team
8                True  Engineering
50               True  Engineering
59              False  Engineering
122              True  Engineering
171              True  Engineering
209             False  Engineering
213              True  Engineering
228              True  Engineering
242              True  Engineering
245             False  Engineering
263              True  Engineering
301             False  Engineering
329               NaN  Engineering
372              True  Engineering
381              True  Engineering
402              True  Engineering
447              True  Engineering
474             False  Engineering
505               NaN  Engineering
507              True  Engineering
521               NaN  Engineering
551             False  Engineering
553             False  Engineering
558             False  Engineering
563             False  Engineering
602              True  Engineering
604              True  Engineering
608               NaN  Engineering
619              True  Engineering
680              True  Engineering
705              True  Engineering
711             False  Engineering
712              True  Engineering
715              True  Engineering
719             False  Engineering
724             False  Engineering
761              True  Engineering
797             False  Engineering
805              True  Engineering
935             False  Engineering
941              True  Engineering
948              True  Engineering
967             False  Engineering
969              True  Engineering
983             False  Engineering
984             False  Engineering
993              True  Engineering

In [33]:
grouped=z.groupby('Gender')
print(grouped.get_group('Female'))

    First Name  Gender  Start Date Last Login Time  Salary  Bonus %  \
2        Maria  Female   4/23/1993        11:17 AM  130590   11.858
6         Ruby  Female   8/17/1987         4:20 PM   65476   10.012
7          NaN  Female   7/20/2015        10:43 AM   45906   11.598
8       Angela  Female  11/22/2005         6:29 AM   95570   18.523
10      Louise  Female   8/12/1980         9:01 AM   63241   15.132
..         ...     ...         ...             ...     ...      ...
987     Gloria  Female   12/8/2014         5:08 AM  136709   10.331
988      Alice  Female   10/5/2004         9:34 AM   47638   11.209
990      Robin  Female   7/24/1987         1:35 PM  100765   10.982
991       Rose  Female   8/25/2002         5:12 AM  134505   11.051
993       Tina  Female   5/15/1997         3:53 PM   56450   19.040

    Senior Management             Team
2               False          Finance
6                True          Product
7                 NaN          Finance
8                True      Engineering
10               True              NaN
..                ...              ...
987              True          Finance
988             False  Human Resources
990              True  Client Services
991              True        Marketing
993              True      Engineering

[202 rows x 8 columns]

In [36]:
c=z.duplicated('Team')
print(c)

2      False
5      False
6      False
7       True
8      False
       ...
993     True
995     True
996     True
998     True
999     True
Length: 495, dtype: bool

In [37]:
d=z[~c]
print(d)

   First Name  Gender  Start Date Last Login Time  Salary  Bonus %  \
2       Maria  Female   4/23/1993        11:17 AM  130590   11.858
5      Dennis    Male   4/18/1987         1:35 AM  115163   10.125
6        Ruby  Female   8/17/1987         4:20 PM   65476   10.012
8      Angela  Female  11/22/2005         6:29 AM   95570   18.523
10     Louise  Female   8/12/1980         9:01 AM   63241   15.132
12    Brandon    Male   12/1/1980         1:08 AM  112807   17.492
18      Diana  Female  10/23/1981        10:27 AM  132940   19.082
21    Matthew    Male    9/5/1995         2:12 AM  100612   13.645
33       Jean  Female  12/18/1993         9:07 AM  119082   16.180
35    Theresa  Female  10/10/2006         1:12 AM   85182   16.675
65      Steve    Male  11/11/2009        11:44 PM   61310   12.428

   Senior Management                  Team
2              False               Finance
5              False                 Legal
6               True               Product
8               True           Engineering
10              True                   NaN
12              True       Human Resources
18             False       Client Services
21             False             Marketing
33             False  Business Development
35             False                 Sales
65              True          Distribution

In [38]:
print(pd.merge(data,data1,on='Name'))

Empty DataFrame
Columns: [Name,  Top Subjects, Marks_x, Top Subjects, Marks_y]
Index: []